app/controllers/readings_controller.rb

  def index
    @thermostat = Thermostat.all
---
SELECT "thermostats".* FROM "thermostats"

  def show
    begin
      reading = Reading.find_by(tracking_number: params[:id], thermostat_id: @thermostat.id)
---
SELECT  "readings".* FROM "readings" WHERE "readings"."tracking_number" = $1 AND "readings"."thermostat_id" = $2 LIMIT $3  [["tracking_number", 3], ["thermostat_id", 10], ["LIMIT", 1]]

  def set_thermostat
    token = params[:household_token]
    render json: { message: 'Please provide household token.' }, status: 401 and return if !token
    @thermostat = Thermostat.find_by(household_token: token)
---
SELECT  "thermostats".* FROM "thermostats" WHERE "thermostats"."household_token" = $1 LIMIT $2  [["household_token", "f9cd497f-d059-4dd9-99cf-007537e47e9a"], ["LIMIT", 1]]